// array
var musicList = [
  "(01) [野見祐二] 日常のタイトル曲.flac",
  "(02) [野見祐二] のんびり生活.flac",
  "(06) [野見祐二] 調子づくゆっこ.flac",
  "(04) [野見祐二] 復活のゆっこ.flac",
  "(03) [野見祐二] 大きすぎるショック.flac",
  "(05) [野見祐二] お涙頂戴.flac",
  "(07) [野見祐二] これはオチです.flac",
  "(12) [野見祐二] 日常の作戦開始.flac",
  "(08) [野見祐二] 東雲研究所の毎日.flac",
  "(09) [野見祐二] のんびりと回想してみる.flac",
  "(10) [野見祐二] コミカルに説教.flac",
  "(11) [野見祐二] 寂しくて少し切ない時.flac",
  "(16) [野見祐二] 日常の登校.flac",
  "(14) [野見祐二] 日常の牧歌的音楽.flac",
  "(13) [野見祐二] ハッピー東雲研究所.flac",
  "(18) [野見祐二] 中之条のテーマ.flac",
  "(17) [野見祐二] 機嫌の良いはかせ.flac",
  "(15) [野見祐二] 日常の優雅さ.flac",
  "(21) [野見祐二] 日常のじゃんけんコーナー.flac",
  "(22) [野見祐二] 日常の予告.flac",
  "(20) [野見祐二] 囲碁サッカー部の日常.flac",
  "(19) [野見祐二] 可愛らしいドキドキ感.flac",
  "(23) [野見祐二] 阪本いぢり.flac",
  "(24) [野見祐二] 笹原のテーマ.flac",
  "(27) [野見祐二] ヒトコトワドコトバ.flac",
  "(25) [野見祐二] ヘルベチカスタンダード～その１～.flac",
  "(28) [野見祐二] 東雲研究所の楽しい喧嘩.flac",
  "(30) [野見祐二] 狐と狸のおマヌケな化かし合い.flac",
  "(26) [野見祐二] 可愛く走る走る走る.flac",
  "(29) [野見祐二] パニックでトラブルでオーマイガー.flac",
  "(36) [野見祐二] ヘルベチカスタンダード～その3～.flac",
  "(32) [野見祐二] ヘルベチカスタンダード～その2～.flac",
  "(31) [野見祐二] 恋心は弾丸も柔らかくする.flac",
  "(34) [野見祐二] 駄々をこねる天才.flac",
  "(35) [野見祐二] ここが落とし所.flac",
  "(33) [野見祐二] マヌケの全力疾走.flac",
  "(41) [野見祐二] まあまあのキセキ.flac",
  "(38) [野見祐二] 不安少女.flac",
  "(42) [野見祐二] 大げさなドキドキ.flac",
  "(39) [野見祐二] 暖かく平和な時間.flac",
  "(37) [野見祐二] 春な日常.flac",
  "(40) [野見祐二] 夏っぽい高校.flac",
  "(45) [野見祐二] 素晴らしくカッコイイ.flac",
  "(44) [野見祐二] 力強くてカッコいいなぁ.flac",
  "(48) [野見祐二] 教室での会話っぽい日常.flac",
  "(43) [野見祐二] ミステリアスで不思議な女.flac",
  "(46) [野見祐二] 女子女子友情.flac",
  "(47) [野見祐二] シリアスでドキドキ.flac",
  "(53) [野見祐二] 愉快な恋心.flac",
  "(52) [野見祐二] 暖かな会話.flac",
  "(54) [野見祐二] 可愛らしい悩み心.flac",
  "(50) [野見祐二] 恋心はひねくれさん.flac",
  "(49) [野見祐二] ポエムofゆっこ.flac",
  "(51) [野見祐二] 日常世界のシリアス代表.flac",
  "(60) [野見祐二] ラブ的 ～学生・青春～.flac",
  "(58) [野見祐二] 恐ろしい危機と能力解放.flac",
  "(55) [野見祐二] 駆け抜ける熱情.flac",
  "(57) [野見祐二] 少女の怯え.flac",
  "(56) [野見祐二] 喜びと幸せと.flac",
  "(59) [野見祐二] 暖かなる女子の友情.flac",
  "(63) [野見祐二] ブラックヘルベチカ ～序章～.flac",
  "(65) [野見祐二] ラブ的 ～子供～.flac",
  "(64) [野見祐二] ブラックヘルベチカ ～本編～.flac",
  "(62) [野見祐二] 動物は奇想天外.flac",
  "(66) [野見祐二] 囲碁サッカー部 ～新入部員～.flac",
  "(61) [野見祐二] This is House of cards ～トランプタワー～.flac",
  "(69) [野見祐二] ダンス ～その1～.flac",
  "(70) [野見祐二] ダンス ～その2～.flac",
  "(71) [野見祐二] ダンス ～その3～.flac",
  "(67) [野見祐二] 囲碁サッカー部 ～顧問誕生～.flac",
  "(68) [野見祐二] 囲碁サッカー部 ～野良試合～.flac",
  "(72) [野見祐二] 冬っぽい高校.flac",
  "(76) [野見祐二] 相対する者たち.flac",
  "(78) [野見祐二] ラブ的 ～日常の中に～.flac",
  "(77) [野見祐二] 秋っぽい高校.flac",
  "(73) [野見祐二] ウキウキハッピネス.flac",
  "(75) [野見祐二] 科学者の脳みそ.flac",
  "(74) [野見祐二] 渋さゆえのドラマ.flac",
  "(79) [野見祐二] 機械人形ですね.flac",
  "(83) [野見祐二] フェイ王国 ～ボヤキ兵士～.flac",
  "(80) [野見祐二] ひどい誤解から来るショッキング.flac",
  "(82) [野見祐二] フェイ王国 ～混乱する兵士たち～.flac",
  "(84) [野見祐二] フェイ王国 ～戦い～.flac",
  "(81) [野見祐二] フェイ王国 ～ドルフの野望～.flac",
  "(89) [野見祐二] 悟りの境地.flac",
  "(88) [野見祐二] 教頭のテーマ.flac",
  "(86) [野見祐二] フェイ王国 ～傍若無人～.flac",
  "(90) [野見祐二] 走馬灯のごとく.flac",
  "(87) [野見祐二] フェイ王国 ～最後の聖戦～.flac",
  "(85) [野見祐二] フェイ王国 ～支配～.flac",
  "(94) [野見祐二] かっこいいもの ～ソフトかっこいい～.flac",
  "(95) [野見祐二] かっこいいもの ～重たいかっこいい～.flac",
  "(93) [野見祐二] 大人のテイクその5.flac",
  "(96) [野見祐二] 3人はまるで家族.flac",
  "(91) [野見祐二] 想像力全開.flac",
  "(92) [野見祐二] 全力の果てに.flac",
  "(99) [野見祐二] ヘルベチカスタンダード.flac",
  "(98) [野見祐二] 日常っぽいクリスマス.flac",
  "(97) [野見祐二] 優雅なる時間からの始まり.flac"
];

// random func
function playRandomMusic() {
  // random index from file array
  var randomIndex = Math.floor(Math.random() * musicList.length);

  //url of randomly chosen song
  var musicURL = musicList[randomIndex];

  var modifiedFileName = musicURL
    .replace(".flac", "")
  // make html audio element
  var audio = new Audio(musicURL);

  // ptag file name
  var fileNameTag = document.getElementById('currentSong');
  fileNameTag.textContent = "song " + modifiedFileName;

  // musisc play
  audio.play();

//event listener
  audio.addEventListener('ended', function() {
    // wait 10 seconds to play different music
    setTimeout(function() {
      playRandomMusic();
    }, 10000);
  });
}

playRandomMusic();
